pyocd/pyOCD/pyocd/debug/svd/data/HC32L07x.svd
                <register>
                    <name>PALIE</name>
                    <description>desc PALIE</description>
                    <addressOffset>0x134</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PA00</name>
                            <description>desc PA00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA01</name>
                            <description>desc PA01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA02</name>
                            <description>desc PA02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA03</name>
                            <description>desc PA03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA04</name>
                            <description>desc PA04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA05</name>
                            <description>desc PA05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA06</name>
                            <description>desc PA06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA07</name>
                            <description>desc PA07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA08</name>
                            <description>desc PA08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA09</name>
                            <description>desc PA09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA10</name>
                            <description>desc PA10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA11</name>
                            <description>desc PA11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA12</name>
                            <description>desc PA12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA13</name>
                            <description>desc PA13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA14</name>
                            <description>desc PA14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA15</name>
                            <description>desc PA15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PARIE</name>
                    <description>desc PARIE</description>
                    <addressOffset>0x138</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PA00</name>
                            <description>desc PA00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA01</name>
                            <description>desc PA01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA02</name>
                            <description>desc PA02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA03</name>
                            <description>desc PA03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA04</name>
                            <description>desc PA04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA05</name>
                            <description>desc PA05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA06</name>
                            <description>desc PA06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA07</name>
                            <description>desc PA07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA08</name>
                            <description>desc PA08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA09</name>
                            <description>desc PA09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA10</name>
                            <description>desc PA10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA11</name>
                            <description>desc PA11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA12</name>
                            <description>desc PA12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA13</name>
                            <description>desc PA13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA14</name>
                            <description>desc PA14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA15</name>
                            <description>desc PA15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PAFIE</name>
                    <description>desc PAFIE</description>
                    <addressOffset>0x13C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PA00</name>
                            <description>desc PA00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA01</name>
                            <description>desc PA01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA02</name>
                            <description>desc PA02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA03</name>
                            <description>desc PA03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA04</name>
                            <description>desc PA04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA05</name>
                            <description>desc PA05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA06</name>
                            <description>desc PA06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA07</name>
                            <description>desc PA07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA08</name>
                            <description>desc PA08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA09</name>
                            <description>desc PA09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA10</name>
                            <description>desc PA10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA11</name>
                            <description>desc PA11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA12</name>
                            <description>desc PA12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA13</name>
                            <description>desc PA13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA14</name>
                            <description>desc PA14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA15</name>
                            <description>desc PA15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PBDIR</name>
                    <description>desc PBDIR</description>
                    <addressOffset>0x140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PB00</name>
                            <description>desc PB00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB01</name>
                            <description>desc PB01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB02</name>
                            <description>desc PB02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB03</name>
                            <description>desc PB03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB04</name>
                            <description>desc PB04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB05</name>
                            <description>desc PB05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB06</name>
                            <description>desc PB06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB07</name>
                            <description>desc PB07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB08</name>
                            <description>desc PB08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB09</name>
                            <description>desc PB09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB10</name>
                            <description>desc PB10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB11</name>
                            <description>desc PB11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB12</name>
                            <description>desc PB12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB13</name>
                            <description>desc PB13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB14</name>
                            <description>desc PB14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB15</name>
                            <description>desc PB15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
